#### AppearanceAssetEditScope Members

---

|  |
| --- |
| AppearanceAssetEditScope Class   Constructors   Methods   Properties   See Also |

The  AppearanceAssetEditScope  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | AppearanceAssetEditScope | Constructs a new instance of an AppearanceAssetEditScope. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Cancel | Cancels the edit scope. |
| Public method | Commit | Finishes the edit scope. |
| Public method | Dispose | Releases all resources used by the  AppearanceAssetEditScope |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | Start | Starts the edit scope. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsActive | Identifies if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

AppearanceAssetEditScope Class

Autodesk.Revit.DB.Visual Namespace